uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
// test_stm32f4_rtc - the reference bench suite for the STM32F4's RTC and
// the backup domain it lives in: stm32f4/rtc.hpp (RM0383 ch. 17 on the
// bench part, RM0090 ch. 26 and RM0390 ch. 22 on its siblings) and, with
// it, the RCC_BDCR half of the clock chapter that only this domain can
// reach.
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// NOTHING TO WIRE, AND THE RULER IS THE CORE'S OWN SYSTICK. Every
// frequency here is a ratio against HCLK, which comes from the board's
// HSE crystal through the PLL, so a crystal weighs a crystal; the core's
// own absolute error is stated where it matters and cancels out of every
// comparison that is a difference. The instrument is RTC_SSR: it counts
// down at ck_apre and RELOADS at each calendar update, so a polling loop
// catches the 1 Hz edge to within its own iteration - a few hundred
// nanoseconds at 100 MHz, well under a part per million over a
// two-second window. The suite therefore runs with BYPSHAD = 1 (a shadow
// copy is refreshed only every two RTCCLK cycles, which would put 30 ppm
// of jitter on every edge); letter e is where the shadow path is
// exercised, and it restores the bypass on its way out.
//
// NO FLASH IS WRITTEN and no option byte is touched.
//
// WHAT IT COSTS THE BOARD, said once: letter c RESETS THE BACKUP DOMAIN
// (RCC_BDCR.BDRST) twice, because RTCSEL is one-way and weighing the LSI
// means selecting it - and a domain reset wipes the calendar, the
// prescalers, the alarms and THE TWENTY BACKUP REGISTERS. Letter l and
// the reboot letter v are written to be run after that, not before, and
// z runs them in that order.
//
// THE PAD. RTC_AF1 is PC13 on every part of this family: the tamper
// input, the timestamp input and RTC_OUT (the calibration output and the
// alarm output) are all that one pin. It carries the LED on the black
// pill (lit when low), the user button on a Nucleo-64, and toggling it is
// ES0287 2.2.10 ("PC13 signal transitions disturb LSE") - so letter m
// weighs the crystal before and after driving it, and letters w and x,
// which leave the pad in the RTC's hands, sit outside z.
//
// What is exercised, letter by letter:
//   a  the domain: the two locks (PWR_CR.DBP and the RTC's own WPR keys),
//      what each of them covers, RTCSEL as a ONE-WAY choice, RTCEN
//   b  LSE: how long this board's crystal takes to start, what it
//      measures against the core clock, and the two register rules
//   c  LSI weighed the same way - which costs two domain resets
//   d  the calendar: BCD both ways, INITS, and four boundaries crossed
//      one second at a time
//   e  the shadow registers against BYPSHAD: RSF, the read cost, the
//      coherence rule and ES0287 2.8.2's re-read
//   f  both alarms: the match, the LATENCY from the match to the
//      handler, the sub-second comparison, and the chapter's own
//      caution about a seconds match under a narrow PREDIV_S
//   g  the wake-up timer on three of its clocks, each period weighed,
//      plus the write window and the two refusals
//   h  ES0287 2.8.4 STAGED: consecutive initialization-mode entries with
//      and without the driver's workaround
//   i  smooth calibration MEASURED, not asserted: CALP and CALM at both
//      ends, each weighed as the length of the calendar's second
//   j  coarse calibration: the register, the three refusals, and the
//      interlock between the two calibrators
//   k  the sub-second register and RTC_SHIFTR: a shift seen as the
//      LENGTH of the one second it lands in
//   l  the twenty backup registers, and which lock covers them
//   m  the RTC_OUT pad: the calibration output COUNTED on PC13's own
//      input register, the alarm output, and the crystal weighed again
//      afterwards (ES0287 2.2.10)
//   n  the timestamp on RTC_AF1, and what this board can and cannot
//      stage on that pad with no wire
//
//   v  (by name only) THE SURVIVAL LETTER. Writes a token into the backup
//      registers, and on its next run - after a system reset, which a
//      re-flash of the same image ends with - checks that it came back.
//      Run it twice with the flash in between:
//          brio run <board> v --app test_stm32f4_rtc
//          brio flash <board> test_stm32f4_rtc
//          brio run <board> v --app test_stm32f4_rtc
//   w  (by name only) THE ERASE. Arms a real tamper on RTC_AF1 - which
//      this board can do with no wire, and which SPENDS the twenty backup
//      registers - and takes the timestamp the tamper writes.
//   x  (by name only) the 1 Hz calibration output LEFT ON, for a human to
//      watch on the LED. It outlives a reset - RTC_CR is not in a system
//      reset's scope - so main() takes the pad back at every boot.
//
// build: boards = f446re,f411ce
// build: monitor_speed = 115200

#include <stdint.h>

#include "stm32f4/clock.hpp"
#include "stm32f4/delay.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/pin.hpp"
#include "stm32f4/platform.hpp"
#include "stm32f4/pwr.hpp"
#include "stm32f4/rtc.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/usart.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

#if defined(STM32F411xE)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 100'000'000, 25'000'000>;
#elif defined(STM32F429xx)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000>;
#else
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000, brio::HseMode::bypass>;
#endif
constexpr SysClock clock;

namespace {

using namespace brio;

using P = Stm32f4Platform<>;

#if defined(STM32F429xx)
using Led = Pin<'G', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#elif defined(STM32F411xE)
using Led = Pin<'C', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#else
using Led = Pin<'A', 5>;
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
#endif

