uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
/// RTC_AF1: the one pad this whole chapter's inputs and outputs share.
using RtcPad = Pin<rtc_af1_port, rtc_af1_pin>;

using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

TestBench<Serial> bench;

// The nominal crystal: the board file's fact, not the driver's.
constexpr uint32_t lse_nominal_hz = 32768;

// ---------------------------------------------------------------------------
// The ruler: SysTick cycles, whole milliseconds from the kernel tick and
// the rest from VAL.
// ---------------------------------------------------------------------------

uint32_t systick_period() { return SysTick->LOAD + 1u; }

/// A wait in whole milliseconds on the kernel tick. delay_us() is capped
/// below one SysTick period by construction (stm32f4/delay.hpp), so
/// anything longer is the ticker's business.
void wait_ms(uint32_t ms) {
    const uint32_t started = Ticker::ticks();
    while (Ticker::ticks() - started <= ms) {
    }
}

/// A monotonic cycle count. THE PENDING BIT IS THE RACE: SysTick can wrap
/// between the VAL read and the tick read, and the handler that would
/// advance the tick has not run yet - so ICSR's PENDSTSET is consulted
/// and the tick corrected by hand. Interrupts are masked for the handful
/// of cycles the read takes, which delays the tick and never loses it.
uint64_t cycles_now() {
    const uint32_t period = systick_period();
    P::CriticalSection cs;
    uint32_t v = SysTick->VAL;
    uint32_t t = Ticker::ticks();
    if ((SCB->ICSR & SCB_ICSR_PENDSTSET_Msk) != 0u) {
        t += 1u;
        v = SysTick->VAL;
    }
    return static_cast<uint64_t>(t) * period + (period - 1u - v);
}

/// Parts per million by which `cycles` differs from `expected`, positive
/// when there are FEWER cycles than expected - i.e. when whatever was
/// being weighed ran FAST.
int32_t ppm_of(uint64_t cycles, uint64_t expected) {
    if (expected == 0u || cycles == 0u) {
        return 0;
    }
    const int64_t delta = static_cast<int64_t>(expected) - static_cast<int64_t>(cycles);
    return static_cast<int32_t>((delta * 1'000'000LL) / static_cast<int64_t>(expected));
}

/// Print a whole number of hertz with three decimals, from a count of
/// millihertz.
void print_hz(uint64_t millihertz) {
    print(serial, static_cast<uint32_t>(millihertz / 1000u), ".");
    const uint32_t frac = static_cast<uint32_t>(millihertz % 1000u);
    if (frac < 100u) {
        print(serial, "0");
    }
    if (frac < 10u) {
        print(serial, "0");
    }
    print(serial, frac, " Hz");
}

/// Catch the RTC_SSR reload that opens a second and the one that closes
/// the n-th, and return the cycles between them. False when the RTC is
/// not counting.
bool measure_seconds(uint8_t n, uint32_t& cycles) {
    const uint32_t started = Ticker::ticks();
    const uint32_t budget = 1500u * (static_cast<uint32_t>(n) + 2u);
    uint16_t prev = Rtc::subsecond();
    uint64_t first = 0;
    uint8_t seen = 0;
    while (Ticker::ticks() - started < budget) {
        const uint16_t now = Rtc::subsecond();
        if (now > prev) {   // the counter counts DOWN: a rise is a reload
            const uint64_t at = cycles_now();
            if (seen == 0u) {
                first = at;
            }
            ++seen;
            if (seen == static_cast<uint8_t>(n + 1u)) {
                cycles = static_cast<uint32_t>(at - first);
                return true;
            }
        }
        prev = now;
    }
    return false;
}

/// Wait, on the kernel tick, for one of the RTC's event flags to stand.
bool wait_flag(uint32_t mask, uint32_t budget_ms) {
    const uint32_t started = Ticker::ticks();
    while (Ticker::ticks() - started < budget_ms) {
        if (Rtc::flag(mask)) {
            return true;
        }
    }
    return false;
}

/// Wait for the CALENDAR's seconds field to change and stamp it. Slower
/// to read than RTC_SSR (a whole coherent reading, some 180 cycles) and
/// immune to what a shift does to the sub-second counter, which a
/// reload-watcher reads as a second of its own.
bool wait_calendar_second(uint64_t& at, uint32_t budget_ms = 2500) {
    RtcReading r{};
    if (!Rtc::read(r)) {
        return false;
    }
    const uint8_t from = r.time.second;
    const uint32_t started = Ticker::ticks();
    while (Ticker::ticks() - started < budget_ms) {
        if (Rtc::read(r) && r.time.second != from) {
            at = cycles_now();
            return true;
        }
    }
    return false;
}

/// Wait for the next RTC_SSR reload and stamp it.
bool wait_second_edge(uint64_t& at, uint32_t budget_ms = 1500) {
    const uint32_t started = Ticker::ticks();
    uint16_t prev = Rtc::subsecond();
    while (Ticker::ticks() - started < budget_ms) {
        const uint16_t now = Rtc::subsecond();
        if (now > prev) {
            at = cycles_now();
            return true;
        }
        prev = now;
    }
    return false;
}

// ---------------------------------------------------------------------------
// The domain, brought up on LSE - what main() does and what letter c has
// to undo after it has been on the LSI.
// ---------------------------------------------------------------------------

constexpr RtcDateTime boot_time{12, 0, 0, 1, 6, 24, 6};   // Saturday 1 June 2024, noon

/// Cycles the crystal took from LSEON to LSERDY at the last bring-up, and
/// whether it was already running when the program found it - which it is
/// after every reset that is not a power-on, the domain being outside the
/// system reset's scope.
uint32_t lse_start_cycles = 0;
bool lse_was_running = false;

bool bring_up(RtcClockSource source) {
    RtcDomain::pwr_bus_clock(true);
    if (!RtcDomain::unlock(true)) {
        return false;
    }
    if (RtcDomain::selected() != source) {
        RtcDomain::reset();
    }
    lse_was_running = RtcDomain::lse_ready();
    const uint64_t t0 = cycles_now();
    if (source == RtcClockSource::lse) {
        RtcDomain::lse_enable(true);
        if (!RtcDomain::lse_wait_ready()) {
            return false;
        }
    } else {
        Rcc::lsi_enable(true);
        if (!Rcc::lsi_wait_ready()) {
            return false;
        }
    }
    lse_start_cycles = static_cast<uint32_t>(cycles_now() - t0);
    if (!RtcDomain::select(source) || !RtcDomain::open(source)) {
        return false;
    }
    Rtc::bypass_shadow(true);
    // TAKE RTC_AF1 BACK. RTC_CR is not reset by a system reset, so a
    // calibration or alarm output left on the pad by letter x is still
    // there at the next boot - and a pad toggling at 512 Hz is ES0287
    // 2.2.10's own hazard to the crystal every other letter weighs.
    (void)Rtc::calibration_output(false);
    Rtc::alarm_output(RtcOutput::off);
    if (!Rtc::calendar_set() && !Rtc::init(RtcPrescalers{}, boot_time)) {
        return false;
    }
    return Rtc::wait_sync();
}

// ---------------------------------------------------------------------------
// What the three handlers leave behind
// ---------------------------------------------------------------------------

volatile uint32_t alarm_served = 0;
volatile uint32_t alarm_count = 0;
volatile uint64_t alarm_at = 0;
volatile uint32_t wakeup_served = 0;
volatile uint32_t wakeup_count = 0;
volatile uint64_t wakeup_at = 0;
volatile uint32_t stamp_served = 0;
volatile uint32_t stamp_count = 0;
volatile uint64_t stamp_at = 0;
RtcReading stamp_reading{};

void arm_vectors() {
    Nvic::enable(Rtc::alarm_irq());
    Nvic::enable(Rtc::wakeup_irq());
    Nvic::enable(Rtc::tamper_stamp_irq());
}

