uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
// =============================================================================
// a - the domain and its two locks
// =============================================================================
void ta_domain() {
    print(serial, "  BDCR ", hex(RtcDomain::bdcr()), " PWR_CR ", hex(PWR->CR), " ISR ",
          hex(Rtc::isr()), " PRER ", hex(Rtc::prer()), crlf);

    bench.verdict("the PWR block's bus clock is open", RtcDomain::pwr_bus_clock());
    bench.verdict("RTCSEL is the LSE and RTCEN is set",
                  RtcDomain::selected() == RtcClockSource::lse && RtcDomain::enabled());
    bench.verdict("re-selecting the source already in force is a no-op and true",
                  RtcDomain::select(RtcClockSource::lse));
    bench.verdict("selecting a DIFFERENT source is refused: RTCSEL is one-way",
                  !RtcDomain::select(RtcClockSource::lsi));

    // DBP: the domain's own lock, over RCC_BDCR and the backup registers.
    const uint32_t keep = Rtc::backup(0);
    bench.verdict("DBP is open", RtcDomain::unlocked());
    (void)RtcDomain::unlock(false);
    bench.verdict("and it closes", !RtcDomain::unlocked());
    (void)Rtc::backup(0, 0xDEADBEEFu);
    const bool locked_out = Rtc::backup(0) != 0xDEADBEEFu;
    (void)RtcDomain::unlock(true);
    (void)Rtc::backup(0, 0xDEADBEEFu);
    const bool let_in = Rtc::backup(0) == 0xDEADBEEFu;
    (void)Rtc::backup(0, keep);
    bench.verdict("a backup-register write with DBP CLOSED does not land", locked_out);
    bench.verdict("the same write with DBP open does", let_in);

    // The RTC's own key, over RTC_CR and its neighbours - proven on CALR,
    // the one register a wrong value cannot hurt.
    const uint32_t calr_was = Rtc::calr();
    Rtc::lock();
    Rtc::calr_unprotected(0x0000'0100u);
    const bool key_holds = Rtc::calr() == calr_was;
    Rtc::unlock();
    Rtc::calr_unprotected(0x0000'0100u);
    const bool key_opens = Rtc::calr() == 0x0000'0100u;
    const bool blocked_after = Rtc::recalibration_pending();
    Rtc::lock();
    bench.verdict("a store into RTC_CALR with the key LOCKED is dropped", key_holds);
    bench.verdict("the same store after 0xCA then 0x53 lands", key_opens);
    // 17.6.4: the store opens a recalibration window in which the
    // register "is blocked" - which is why calibrate() waits RECALPF out
    // and calr_unprotected(), the bench's own back door, does not.
    bench.verdict("and it leaves RECALPF standing, so the next raw store would be lost",
                  blocked_after);
    bench.verdict("the driver's calibrate() waits that window out and puts the register back",
                  Rtc::calibrate(RtcCalibration{}) && Rtc::calr() == 0u);

    // RTC_TAFCR sits outside the key (17.3.5's exception list).
    const bool tamp_ts_was = Rtc::timestamp_on_tamper();
    Rtc::lock();
    Rtc::timestamp_on_tamper(!tamp_ts_was);
    const bool tafcr_open = Rtc::timestamp_on_tamper() == !tamp_ts_was;
    Rtc::timestamp_on_tamper(tamp_ts_was);
    bench.verdict("RTC_TAFCR is OUTSIDE the key: a write lands with it locked", tafcr_open);

    // And so does the flag half of RTC_ISR.
    Rtc::clear_flags(RtcFlag::all);
    bench.verdict("no event flag stands after a clear with the key locked",
                  (Rtc::status() & RtcFlag::all) == 0u);
}

// =============================================================================
// b - the LSE crystal: how long it takes and what it is worth
// =============================================================================
void tb_lse() {
    const uint32_t cycles_per_ms = SysClock::hz / 1000u;
    if (lse_was_running) {
        print(serial, "  at boot the crystal was ALREADY running: the backup domain is outside "
                      "a system reset's scope", crlf);
    } else {
        print(serial, "  at boot LSERDY came ", lse_start_cycles / cycles_per_ms,
              " ms after LSEON", crlf);
    }

    // The two register rules, checked while the oscillator runs.
    bench.verdict("LSEBYP is refused while the oscillator is on", !RtcDomain::lse_bypass(true));
    if constexpr (RtcDomain::has_lse_mode()) {
        bench.verdict("LSEMOD is refused while the oscillator is on",
                      !RtcDomain::lse_mode(LseMode::high_drive));
    } else {
        bench.verdict("this part's RCC_BDCR has no LSEMOD, and the verb says so",
                      !RtcDomain::lse_mode(LseMode::high_drive));
    }

    // Stop it and start it again, with the ruler running.
    RtcDomain::lse_enable(false);
    uint32_t spins = 0;
    while (RtcDomain::lse_ready() && spins < RtcDomain::ready_spins) {
        ++spins;
    }
    const bool stopped = !RtcDomain::lse_ready();
    bench.verdict("LSEON clear brings LSERDY down", stopped);
    bench.verdict("with the oscillator stopped, LSEBYP is writable",
                  RtcDomain::lse_bypass(true) && RtcDomain::lse_bypass());
    (void)RtcDomain::lse_bypass(false);
    bench.verdict("and writable back", !RtcDomain::lse_bypass());

    const uint64_t t0 = cycles_now();
    RtcDomain::lse_enable(true);
    const bool back = RtcDomain::lse_wait_ready();
    const uint32_t start_cycles = static_cast<uint32_t>(cycles_now() - t0);
    print(serial, "  a cold start took ", start_cycles / cycles_per_ms, " ms (",
          start_cycles / (SysClock::hz / 1'000'000u), " us)", crlf);
    bench.verdict("the crystal starts again", back);
    bench.verdict("and it takes between a millisecond and four seconds",
                  start_cycles > cycles_per_ms && start_cycles < 4u * SysClock::hz);

    (void)Rtc::wait_sync();

    // The crystal, weighed against the core's own clock over two seconds.
    uint32_t cycles = 0;
    const bool measured = measure_seconds(2, cycles);
    bench.verdict("two calendar seconds can be caught on RTC_SSR's reload", measured);
    if (!measured) {
        return;
    }
    const uint32_t per_second = rtc_cycles_per_second(Rtc::prescalers());
    const uint64_t millihertz =
        (static_cast<uint64_t>(per_second) * 2ULL * SysClock::hz * 1000ULL) / cycles;
    const int32_t ppm = ppm_of(cycles, 2ULL * SysClock::hz);
    print(serial, "  two seconds = ", cycles, " core cycles; RTCCLK = ");
    print_hz(millihertz);
    print(serial, ", ", ppm, " ppm fast against the core clock", crlf);
    bench.verdict("the crystal is within 200 ppm of 32768 Hz",
                  millihertz > 1000ULL * (lse_nominal_hz - 7u) &&
                      millihertz < 1000ULL * (lse_nominal_hz + 7u));
    bench.verdict("and the calendar's second is within 200 ppm of the core's",
                  ppm > -200 && ppm < 200);
}

