uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
// =============================================================================
// c - the LSI on the same ruler, and what it costs
// =============================================================================
void tc_lsi() {
    print(serial, "  this letter resets the backup domain twice: the calendar, "
                  "the alarms and the twenty backup registers are spent", crlf);

    const bool to_lsi = bring_up(RtcClockSource::lsi);
    bench.verdict("a domain reset lets RTCSEL move, and the LSI is selected",
                  to_lsi && RtcDomain::selected() == RtcClockSource::lsi);
    bench.verdict("the domain reset wiped the backup registers", Rtc::backup(0) == 0u);

    uint32_t cycles = 0;
    if (to_lsi && measure_seconds(2, cycles)) {
        const uint32_t per_second = rtc_cycles_per_second(Rtc::prescalers());
        const uint64_t millihertz =
            (static_cast<uint64_t>(per_second) * 2ULL * SysClock::hz * 1000ULL) / cycles;
        const int32_t off = static_cast<int32_t>(
            ((static_cast<int64_t>(millihertz) - 1000LL * lse_nominal_hz) * 1'000'000LL) /
            (1000LL * lse_nominal_hz));
        print(serial, "  the LSI measures ");
        print_hz(millihertz);
        print(serial, ", ", off, " ppm off 32768 (RM0383 says 32 kHz nominal, 17..47 kHz "
                      "over the range)", crlf);
        bench.verdict("the LSI is inside its own datasheet window",
                      millihertz > 17'000'000ULL && millihertz < 47'000'000ULL);
        bench.verdict("and it is no crystal: more than a thousand ppm off nominal",
                      off > 1000 || off < -1000);
    } else {
        bench.verdict("two calendar seconds on the LSI", false);
        bench.verdict("the LSI is inside its own datasheet window", false);
    }

    const bool back = bring_up(RtcClockSource::lse);
    bench.verdict("and the domain goes back to the crystal",
                  back && RtcDomain::selected() == RtcClockSource::lse);
    bench.verdict("with a calendar running again", Rtc::calendar_set());
}

// =============================================================================
// d - the calendar, BCD both ways and four boundaries
// =============================================================================
bool set_and_wait(const RtcDateTime& from, RtcDateTime& landed) {
    if (!Rtc::init(Rtc::prescalers(), from)) {
        return false;
    }
    uint64_t at = 0;
    if (!wait_second_edge(at, 2000)) {
        return false;
    }
    (void)delay_us(clock, 500);   // let the shadow settle behind the reload
    RtcReading r{};
    if (!Rtc::read(r)) {
        return false;
    }
    landed = r.time;
    return true;
}

void td_calendar() {
    const RtcDateTime want{13, 45, 7, 29, 2, 24, 4};
    bench.verdict("the calendar takes a setting in initialization mode",
                  Rtc::init(Rtc::prescalers(), want));
    RtcReading r{};
    const bool got = Rtc::read(r);
    print(serial, "  read back ", r.time.year, "-", r.time.month, "-", r.time.day, " ",
          r.time.hour, ":", r.time.minute, ":", r.time.second, " weekday ", r.time.weekday,
          " ss ", r.subsecond, crlf);
    bench.verdict("and gives it back through the BCD registers unchanged",
                  got && r.time.hour == 13 && r.time.minute == 45 && r.time.day == 29 &&
                      r.time.month == 2 && r.time.year == 24 && r.time.weekday == 4);
    bench.verdict("INITS says the calendar has been set", Rtc::calendar_set());
    bench.verdict("a calendar write outside initialization mode is refused",
                  !Rtc::set_calendar(want));
    bench.verdict("and an impossible date is refused inside it too",
                  !Rtc::init(Rtc::prescalers(), RtcDateTime{0, 0, 0, 31, 2, 24, 1}));

    RtcDateTime landed{};
    bench.verdict("23:59:59 rolls into midnight and the next day",
                  set_and_wait(RtcDateTime{23, 59, 59, 1, 6, 24, 6}, landed) &&
                      landed.hour == 0 && landed.minute == 0 && landed.second == 0 &&
                      landed.day == 2 && landed.month == 6);
    bench.verdict("28 February of a leap year is followed by the 29th",
                  set_and_wait(RtcDateTime{23, 59, 59, 28, 2, 24, 3}, landed) &&
                      landed.day == 29 && landed.month == 2 && landed.weekday == 4);
    bench.verdict("28 February of an ordinary year is followed by 1 March",
                  set_and_wait(RtcDateTime{23, 59, 59, 28, 2, 25, 5}, landed) &&
                      landed.day == 1 && landed.month == 3);
    bench.verdict("31 December carries the year",
                  set_and_wait(RtcDateTime{23, 59, 59, 31, 12, 24, 2}, landed) &&
                      landed.day == 1 && landed.month == 1 && landed.year == 25);
}

// =============================================================================
// e - the shadow registers against BYPSHAD
// =============================================================================
void te_shadow() {
    bench.verdict("this program's PCLK1 clears 17.3.6's seven-times rule",
                  rtc_shadow_read_allowed(SysClock::pclk1_hz, lse_nominal_hz));

    // The bypass path first - the one the rest of this suite reads in.
    bench.verdict("BYPSHAD is set", Rtc::bypass_shadow());
    const uint64_t b0 = cycles_now();
    RtcReading r{};
    bool ok = true;
    for (uint8_t i = 0; i < 16u; ++i) {
        ok = ok && Rtc::read(r);
    }
    const uint32_t bypass_cost = static_cast<uint32_t>((cycles_now() - b0) / 16u);
    bench.verdict("sixteen coherent readings come back with the shadows bypassed", ok);

    // And the shadow path.
    Rtc::bypass_shadow(false);
    bench.verdict("wait_sync clears RSF and waits for the next copy", Rtc::wait_sync());
    bench.verdict("RSF stands after it", Rtc::synchronized());
    const uint64_t s0 = cycles_now();
    ok = true;
    for (uint8_t i = 0; i < 16u; ++i) {
        ok = ok && Rtc::read(r);
    }
    const uint32_t shadow_cost = static_cast<uint32_t>((cycles_now() - s0) / 16u);
    bench.verdict("and sixteen through the shadows, with ES0287 2.8.2's re-read", ok);
    print(serial, "  a coherent read costs ", shadow_cost,
          " cycles through the shadows (SSR, TR, DR and SSR again) and ", bypass_cost,
          " with them bypassed (the whole triple twice)", crlf);

    // Coherence: the second never goes backwards across a reading, and the
    // sub-second agrees with the second it came with.
    uint8_t last = r.time.second;
    bool monotonic = true;
    const uint32_t started = Ticker::ticks();
    while (Ticker::ticks() - started < 1200u) {
        if (!Rtc::read(r)) {
            monotonic = false;
            break;
        }
        const uint8_t now = r.time.second;
        if (now != last && now != static_cast<uint8_t>((last + 1u) % 60u)) {
            monotonic = false;
            break;
        }
        last = now;
    }
    bench.verdict("over a second of shadow reads the calendar never jumps", monotonic);
    bench.verdict("and the sub-second stays inside PREDIV_S",
                  r.subsecond <= Rtc::prescalers().sync);

    Rtc::bypass_shadow(true);
    bench.verdict("the bypass is restored for the rest of the suite", Rtc::bypass_shadow());
}

