uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
// =============================================================================
// f - both alarms
// =============================================================================
void tf_alarms() {
    Rtc::clear_alarm(RtcAlarmId::a);
    Rtc::clear_alarm(RtcAlarmId::b);
    bench.verdict("with an alarm disabled its write flag rises",
                  (Rtc::isr() & RTC_ISR_ALRAWF) != 0u);

    // Alarm A on a stated second, with the seconds field compared.
    RtcReading now{};
    bench.verdict("the calendar can be read", Rtc::read(now));
    const uint8_t target = static_cast<uint8_t>((now.time.second + 3u) % 60u);
    alarm_count = 0;
    alarm_served = 0;
    RtcAlarm a{};
    a.second = target;
    a.mask_seconds = false;
    bench.verdict("alarm A takes a seconds-only match", Rtc::set_alarm(RtcAlarmId::a, a));
    bench.verdict("its EXTI line is open", Rtc::wake_line_is_open(Rtc::alarm_exti_line));

    // Follow the second edges until the handler fires: the last edge
    // before it IS the match, so the difference is the flag's latency.
    uint64_t last_edge = 0;
    const uint32_t started = Ticker::ticks();
    while (alarm_count == 0u && Ticker::ticks() - started < 5000u) {
        uint64_t at = 0;
        if (wait_second_edge(at, 1500)) {
            if (alarm_count == 0u) {
                last_edge = at;
            }
        }
    }
    const bool fired = alarm_count != 0u;
    bench.verdict("and it fires", fired);
    if (fired) {
        const uint32_t latency = static_cast<uint32_t>(alarm_at - last_edge);
        print(serial, "  alarm A landed ", latency, " core cycles (",
              latency / (SysClock::hz / 1'000'000u), " us) after the second's edge", crlf);
        bench.verdict("the handler served alarm A and nothing else",
                      alarm_served == RtcFlag::alarm_a);
        bench.verdict("and the latency is under a millisecond", latency < SysClock::hz / 1000u);
        bench.verdict("the flag is down again", !Rtc::flag(RtcFlag::alarm_a));
    } else {
        bench.verdict("the handler served alarm A and nothing else", false);
        bench.verdict("and the latency is under a millisecond", false);
        bench.verdict("the flag is down again", false);
    }
    Rtc::clear_alarm(RtcAlarmId::a);

    // Alarm B with the SUB-SECOND field: half a second into every second.
    const uint16_t half = static_cast<uint16_t>((Rtc::prescalers().sync + 1u) / 2u);
    RtcAlarm b{};
    b.subsecond_mask = 15;
    b.subsecond = half;
    bench.verdict("alarm B takes a sub-second match every second",
                  Rtc::set_alarm(RtcAlarmId::b, b));
    uint64_t edge = 0;
    const bool got_edge = wait_second_edge(edge, 1500);
    // The count is zeroed AFTER the edge: the alarm fires every second,
    // and a firing that preceded the edge would measure a negative offset.
    alarm_count = 0;
    const uint32_t waited = Ticker::ticks();
    while (alarm_count == 0u && Ticker::ticks() - waited < 1500u) {
    }
    if (got_edge && alarm_count != 0u) {
        const uint32_t offset = static_cast<uint32_t>(alarm_at - edge);
        const uint32_t ms = offset / (SysClock::hz / 1000u);
        print(serial, "  alarm B landed ", ms, " ms into the second (500 due)", crlf);
        bench.verdict("and it lands half a second in, to a few milliseconds",
                      ms >= 495u && ms <= 505u);
        bench.verdict("the handler served alarm B", (alarm_served & RtcFlag::alarm_b) != 0u);
    } else {
        bench.verdict("and it lands half a second in, to a few milliseconds", false);
        bench.verdict("the handler served alarm B", false);
    }
    Rtc::clear_alarm(RtcAlarmId::b);
    bench.verdict("both alarms are off", !Rtc::alarm_enabled(RtcAlarmId::a) &&
                                             !Rtc::alarm_enabled(RtcAlarmId::b));

    // The chapter's caution, as a refusal: a seconds match wants
    // PREDIV_S >= 2.
    const RtcPrescalers keep = Rtc::prescalers();
    RtcReading save{};
    (void)Rtc::read(save);
    const bool narrowed = Rtc::init(RtcPrescalers{127, 1}, save.time);
    const bool refused = !Rtc::set_alarm(RtcAlarmId::a, a);
    (void)Rtc::init(keep, save.time);
    bench.verdict("a seconds match under PREDIV_S = 1 is refused (17.3.3's caution)",
                  narrowed && refused);
    bench.verdict("and the prescalers are back", Rtc::prescalers().sync == keep.sync);
}

// =============================================================================
// g - the wake-up timer
// =============================================================================
bool weigh_wakeup(RtcWakeupClock c, uint32_t reload, uint8_t periods, uint32_t& cycles) {
    wakeup_count = 0;
    if (!Rtc::set_wakeup(c, reload)) {
        return false;
    }
    uint64_t first = 0;
    uint32_t seen = 0;
    const uint32_t started = Ticker::ticks();
    while (Ticker::ticks() - started < 1500u * (periods + 2u)) {
        const uint32_t n = wakeup_count;
        if (n != seen) {
            seen = n;
            if (seen == 1u) {
                first = wakeup_at;
            } else if (seen == static_cast<uint32_t>(periods) + 1u) {
                cycles = static_cast<uint32_t>(wakeup_at - first);
                return true;
            }
        }
    }
    return false;
}

void report_wakeup(const char* name, RtcWakeupClock c, uint32_t reload, uint8_t periods,
                   uint32_t expected_rtcclk_per_period) {
    uint32_t cycles = 0;
    if (!weigh_wakeup(c, reload, periods, cycles)) {
        bench.verdict(name, false);
        return;
    }
    const uint64_t expected = (static_cast<uint64_t>(expected_rtcclk_per_period) * periods *
                               SysClock::hz) /
                              lse_nominal_hz;
    const int32_t ppm = ppm_of(cycles, expected);
    print(serial, "  ", name, ": ", periods, " periods = ", cycles, " cycles, ",
          static_cast<uint32_t>(expected), " due, ", ppm, " ppm fast", crlf);
    bench.verdict(name, ppm > -300 && ppm < 300);
}

void tg_wakeup() {
    Rtc::clear_wakeup();
    bench.verdict("with the timer disabled WUTWF rises", Rtc::wakeup_write_allowed());
    bench.verdict("a reload past the 16-bit field is refused",
                  !Rtc::set_wakeup(RtcWakeupClock::div16, 0x10000u));
    bench.verdict("and RTCCLK/2 with a reload of zero is refused (17.6.6)",
                  !Rtc::set_wakeup(RtcWakeupClock::div2, 0u));

