uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
    report_wakeup("RTCCLK/16, 2048 ticks = one second", RtcWakeupClock::div16, 2047, 2, 32768);
    report_wakeup("RTCCLK/2, 16384 ticks = one second", RtcWakeupClock::div2, 16383, 2, 32768);
    report_wakeup("ck_spre, one tick = one second", RtcWakeupClock::ck_spre, 0, 2, 32768);

    bench.verdict("the wake-up EXTI line is open", Rtc::wake_line_is_open(Rtc::wakeup_exti_line));
    bench.verdict("the handler served the wake-up flag and nothing else",
                  wakeup_served == RtcFlag::wakeup);
    Rtc::clear_wakeup();
    bench.verdict("and the timer stops", !Rtc::wakeup_enabled());
}

// =============================================================================
// h - ES0287 2.8.4 staged
// =============================================================================
uint8_t hammer_init(bool with_workaround, uint8_t rounds) {
    uint8_t corrupted = 0;
    const RtcDateTime first{1, 2, 3, 4, 5, 6, 7};
    const RtcDateTime second{11, 22, 33, 14, 11, 21, 1};
    for (uint8_t i = 0; i < rounds; ++i) {
        if (!Rtc::enter_init()) {
            return 0xFF;
        }
        (void)Rtc::set_calendar(first);
        if (with_workaround) {
            (void)Rtc::exit_init();
        } else {
            Rtc::exit_init_raw();
        }
        // Straight back in: the erratum's window is one to two RTCCLK
        // cycles wide, which is where this lands with no workaround.
        if (!Rtc::enter_init()) {
            return 0xFF;
        }
        (void)Rtc::set_calendar(second);
        (void)Rtc::exit_init();
        RtcReading r{};
        if (!Rtc::read(r) || r.time.hour != second.hour || r.time.minute != second.minute ||
            r.time.second != second.second || r.time.day != second.day ||
            r.time.month != second.month || r.time.year != second.year) {
            ++corrupted;
        }
    }
    return corrupted;
}

void th_init_erratum() {
    constexpr uint8_t rounds = 200;
    const uint8_t bare = hammer_init(false, rounds);
    const uint8_t fixed_ = hammer_init(true, rounds);
    print(serial, "  ", rounds, " consecutive initialization pairs: ", bare,
          " corrupted with the bare exit, ", fixed_, " with ES0287 2.8.4's workaround", crlf);
    bench.verdict("the initialization mode is reachable at all", bare != 0xFF && fixed_ != 0xFF);
    bench.verdict("with the workaround, no calendar is corrupted", fixed_ == 0);

    RtcReading r{};
    (void)Rtc::read(r);
    (void)Rtc::init(Rtc::prescalers(), boot_time);
    bench.verdict("and the calendar can be set again afterwards", Rtc::calendar_set());
}

// =============================================================================
// i - smooth calibration, measured
// =============================================================================
int32_t weigh_calibration(const RtcCalibration& c, uint8_t seconds) {
    if (!Rtc::calibrate(c)) {
        return INT32_MIN;
    }
    // Let the setting take: 17.3.11 gives it three ck_apre cycles, and the
    // masked pulses are spread over the whole window.
    wait_ms(50);
    uint32_t cycles = 0;
    if (!measure_seconds(seconds, cycles)) {
        return INT32_MIN;
    }
    return ppm_of(cycles, static_cast<uint64_t>(seconds) * SysClock::hz);
}

void ti_calibration() {
    const int32_t base = weigh_calibration(RtcCalibration{}, 2);
    const int32_t plus = weigh_calibration(RtcCalibration{.plus = true}, 2);
    const int32_t half = weigh_calibration(RtcCalibration{.minus = 256}, 2);
    const int32_t minus = weigh_calibration(RtcCalibration{.minus = 511}, 2);
    (void)Rtc::calibrate(RtcCalibration{});

    print(serial, "  the calendar's second, in ppm against the core clock: ", base,
          " uncalibrated, ", plus, " with CALP, ", half, " with CALM 256, ", minus,
          " with CALM 511", crlf);
    print(serial, "  the arithmetic says ", rtc_calibration_ppb(RtcCalibration{.plus = true}) / 1000,
          ", ", rtc_calibration_ppb(RtcCalibration{.minus = 256}) / 1000, " and ",
          rtc_calibration_ppb(RtcCalibration{.minus = 511}) / 1000, " ppm", crlf);

    bench.verdict("all four windows can be weighed",
                  base != INT32_MIN && plus != INT32_MIN && half != INT32_MIN &&
                      minus != INT32_MIN);
    bench.verdict("CALP speeds the calendar by 488 ppm, to within 30",
                  plus - base > 458 && plus - base < 518);
    bench.verdict("CALM 256 slows it by 244 ppm, to within 30",
                  base - half > 214 && base - half < 274);
    bench.verdict("CALM 511 slows it by 487 ppm, to within 30",
                  base - minus > 457 && base - minus < 517);
    bench.verdict("and the register is back at zero", Rtc::calr() == 0u);
    bench.verdict("the 16-second window's stuck bit is refused",
                  !Rtc::calibrate(RtcCalibration{.minus = 1,
                                                 .window = RtcCalibrationWindow::seconds16}));
    bench.verdict("the 8-second window's two are refused",
                  !Rtc::calibrate(RtcCalibration{.minus = 2,
                                                 .window = RtcCalibrationWindow::seconds8}));
    bench.verdict("a legal 8-second setting is not",
                  Rtc::calibrate(RtcCalibration{.minus = 4,
                                                .window = RtcCalibrationWindow::seconds8}));
    (void)Rtc::calibrate(RtcCalibration{});
}

// =============================================================================
// j - coarse calibration and the interlock
// =============================================================================
/// Wait RECALPF out on the kernel tick - up to three ck_apre periods
/// (about twelve milliseconds at 32768 Hz) after a write to RTC_CALR.
bool wait_recalibration(uint32_t budget_ms = 100) {
    const uint32_t started = Ticker::ticks();
    while (Rtc::recalibration_pending() && Ticker::ticks() - started < budget_ms) {
    }
    return !Rtc::recalibration_pending();
}

void tj_coarse() {
    bench.verdict("coarse calibration is refused outside initialization mode",
                  !Rtc::coarse_calibrate(true, RtcCoarseCalibration{false, 4}));

    RtcReading r{};
    (void)Rtc::read(r);
    bench.verdict("a smooth setting goes in with the calendar running",
                  Rtc::calibrate(RtcCalibration{.minus = 8}));
    bench.verdict("and RECALPF clears within three ck_apre periods", wait_recalibration());

