uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
    bench.verdict("initialization mode opens", Rtc::enter_init());
    bench.verdict("with RTC_CALR non-zero the coarse calibrator is refused",
                  !Rtc::coarse_calibrate(true, RtcCoarseCalibration{false, 4}));
    // THE CALENDAR IS STOPPED IN HERE, and ck_apre with it, so the flag a
    // CALR write raises never falls: the smooth calibrator cannot be
    // written twice in initialization mode. Measured, not deduced.
    const bool wrote_in_init = Rtc::calibrate(RtcCalibration{});
    const bool cleared_in_init = wait_recalibration(200);
    const bool cleared_running = Rtc::exit_init() && wait_recalibration(200);
    bench.verdict("a smooth setting can be written with the calendar stopped", wrote_in_init);
    bench.verdict("and RECALPF falls once the calendar runs again", cleared_running);
    bench.verdict("initialization mode opens again", Rtc::enter_init());
    bench.verdict("with the smooth one at zero it is accepted",
                  Rtc::coarse_calibrate(true, RtcCoarseCalibration{true, 7}));
    bench.verdict("DCE is set and RTC_CALIBR holds the setting",
                  Rtc::coarse_calibration_enabled() && Rtc::coarse_calibration().negative &&
                      Rtc::coarse_calibration().steps == 7);
    bench.verdict("and now the SMOOTH one is refused", !Rtc::calibrate(RtcCalibration{}));
    print(serial, "  DC 7 negative is ", rtc_coarse_calibration_ppb(RtcCoarseCalibration{true, 7}),
          " ppb, DC 31 positive is ",
          rtc_coarse_calibration_ppb(RtcCoarseCalibration{false, 31}), " ppb", crlf);
    print(serial, "  RECALPF after an RTC_CALR write with the calendar STOPPED: ",
          cleared_in_init ? "clears" : "stands", "; with it running: ",
          cleared_running ? "clears" : "stands", crlf);

    // The PREDIV_A caution, staged by narrowing the asynchronous prescaler.
    bench.verdict("the coarse calibrator is turned off", Rtc::coarse_calibrate(false));
    (void)Rtc::set_prescalers(RtcPrescalers{3, 8191});
    bench.verdict("under PREDIV_A = 3 it is refused (17.3.10's caution)",
                  !Rtc::coarse_calibrate(true, RtcCoarseCalibration{false, 4}));
    (void)Rtc::set_prescalers(RtcPrescalers{});
    bench.verdict("initialization mode closes", Rtc::exit_init());
    bench.verdict("the smooth calibrator is writable again", Rtc::calibrate(RtcCalibration{}));
    (void)Rtc::init(RtcPrescalers{}, r.time);
}

// =============================================================================
// k - the sub-second register and a shift
// =============================================================================
/// Time `changes` transitions of the calendar's seconds field across a
/// shift issued right after the one that opens the window.
///
/// ONE FOR A DELAY AND TWO FOR AN ADVANCE, and the asymmetry is the
/// register's: SUBFS only pushes the next update back, while ADD1S bumps
/// the calendar THE INSTANT the shift lands and then pushes the update
/// back as well. So a delayed clock shows one long second and an advanced
/// one shows two seconds inside one and a half.
int32_t weigh_shift(bool add1s, uint16_t subfs, uint8_t changes) {
    uint64_t before = 0;
    if (!wait_calendar_second(before)) {
        return INT32_MIN;
    }
    if (!Rtc::shift(add1s, subfs)) {
        return INT32_MIN;
    }
    uint64_t after = 0;
    for (uint8_t i = 0; i < changes; ++i) {
        if (!wait_calendar_second(after)) {
            return INT32_MIN;
        }
    }
    // The shift takes up to a second of RTCCLK to land; SHPF is the
    // completion, and the second it lands in is the one just measured.
    const uint32_t started = Ticker::ticks();
    while (Rtc::shift_pending() && Ticker::ticks() - started < 2000u) {
    }
    return static_cast<int32_t>((after - before) / (SysClock::hz / 1000u));
}

void tk_shift() {
    const uint16_t sync = Rtc::prescalers().sync;
    const uint16_t s0 = Rtc::subsecond();
    wait_ms(20);
    const uint16_t s1 = Rtc::subsecond();
    print(serial, "  RTC_SSR read ", s0, " then ", s1, " twenty milliseconds later (PREDIV_S ",
          sync, ")", crlf);
    bench.verdict("the sub-second counter counts DOWN and stays inside PREDIV_S",
                  s0 <= sync && s1 <= sync && s1 != s0);
    bench.verdict("no shift is pending", !Rtc::shift_pending());

    const uint16_t half = static_cast<uint16_t>((sync + 1u) / 2u);
    const int32_t delayed = weigh_shift(false, half, 1);
    const int32_t advanced = weigh_shift(true, half, 2);
    print(serial, "  SUBFS alone: one calendar second took ", delayed,
          " ms. ADD1S with it: two took ", advanced, " ms", crlf);
    bench.verdict("SUBFS alone DELAYS the clock by half a second: the second it lands "
                  "in is 1500 ms long",
                  delayed > 1420 && delayed < 1580);
    bench.verdict("ADD1S with the same SUBFS ADVANCES it by half: two seconds inside 1500 ms",
                  advanced > 1420 && advanced < 1580);
    bench.verdict("a SUBFS past the fifteen-bit field is refused", !Rtc::shift(false, 0x8000u));
    bench.verdict("and the shift has completed", !Rtc::shift_pending());
}

// =============================================================================
// l - the twenty backup registers
// =============================================================================
void tl_backup() {
    print(serial, "  this part has ", Rtc::backup_count, " backup registers", crlf);
    bench.verdict("the header's own count is twenty", Rtc::backup_count == 20);

    bool all_back = true;
    for (uint8_t i = 0; i < Rtc::backup_count; ++i) {
        all_back = all_back && Rtc::backup(i, 0xA5000000u | i);
    }
    for (uint8_t i = 0; i < Rtc::backup_count; ++i) {
        all_back = all_back && Rtc::backup(i) == (0xA5000000u | i);
    }
    bench.verdict("every one of them holds a word of its own", all_back);
    bench.verdict("an index past the end is refused, both ways",
                  !Rtc::backup(Rtc::backup_count, 0u) && Rtc::backup(Rtc::backup_count) == 0u);

    // The key does not cover them; DBP does.
    Rtc::lock();
    const bool key_free = Rtc::backup(1, 0x11223344u) && Rtc::backup(1) == 0x11223344u;
    bench.verdict("the RTC's own key does NOT cover the backup registers", key_free);
    (void)RtcDomain::unlock(false);
    (void)Rtc::backup(1, 0x55667788u);
    const bool dbp_covers = Rtc::backup(1) == 0x11223344u;
    (void)RtcDomain::unlock(true);
    bench.verdict("but DBP does", dbp_covers);
    (void)Rtc::backup(1, 0xA5000001u);
    bench.verdict("and the word is what it was", Rtc::backup(1) == 0xA5000001u);
}

