uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
// =============================================================================
// m - the RTC_OUT pad
// =============================================================================
/// Count rising edges on RTC_AF1's own input register over `ms`, and give
/// back the cycles the window really lasted.
uint32_t count_pad_edges(uint32_t ms, uint32_t& cycles) {
    uint32_t edges = 0;
    bool last = RtcPad::read();
    const uint64_t t0 = cycles_now();
    const uint32_t started = Ticker::ticks();
    while (Ticker::ticks() - started < ms) {
        const bool now = RtcPad::read();
        if (now && !last) {
            ++edges;
        }
        last = now;
    }
    cycles = static_cast<uint32_t>(cycles_now() - t0);
    return edges;
}

void tm_output() {
    // The crystal, before the pad is asked to do anything (ES0287 2.2.10).
    uint32_t quiet_cycles = 0;
    const bool quiet = measure_seconds(2, quiet_cycles);
    const int32_t quiet_ppm = quiet ? ppm_of(quiet_cycles, 2ULL * SysClock::hz) : 0;

    RtcPad::input();
    bench.verdict("RTC_AF1 reads its pad through the GPIO's input register either way",
                  RtcPad::read() || !RtcPad::read());

    bench.verdict("the 512 Hz output is refused unless PREDIV_A is 127",
                  Rtc::prescalers().async != 127u ||
                      Rtc::calibration_output(true, RtcCalibOutput::hz512));
    uint32_t window = 0;
    const uint32_t fast = count_pad_edges(1000, window);
    const uint32_t fast_hz = static_cast<uint32_t>(
        (static_cast<uint64_t>(fast) * SysClock::hz) / (window == 0u ? 1u : window));
    print(serial, "  RTC_CALIB counted ", fast, " rising edges in ", window, " cycles = ", fast_hz,
          " Hz (512 due)", crlf);
    bench.verdict("and it is 512 Hz on the pad, to one per cent",
                  fast_hz > 507u && fast_hz < 517u);

    bench.verdict("the 1 Hz output takes PREDIV_S ending in 0xFF",
                  Rtc::calibration_output(true, RtcCalibOutput::hz1));
    const uint32_t slow = count_pad_edges(4200, window);
    print(serial, "  and at COSEL = 1, ", slow, " edges in 4.2 s (4 due)", crlf);
    bench.verdict("which is the calendar's own second on a pin", slow == 4u);

    bench.verdict("the output turns off", Rtc::calibration_output(false) &&
                                              !Rtc::calibration_output());

    // The alarm output: the pad follows the wake-up flag.
    Rtc::alarm_output(RtcOutput::wakeup, false, true);
    bench.verdict("OSEL reads back as the wake-up output",
                  Rtc::alarm_output() == RtcOutput::wakeup);
    (void)Rtc::set_wakeup(RtcWakeupClock::ck_spre, 0, false);
    wait_ms(50);
    Rtc::clear_flags(RtcFlag::wakeup);
    wait_ms(20);
    const bool low_while_clear = !RtcPad::read();
    const bool flag_came = wait_flag(RtcFlag::wakeup, 1500);
    wait_ms(1);
    const bool high_while_set = flag_came && RtcPad::read();
    print(serial, "  RTC_ALARM on the pad: ", low_while_clear ? "low" : "high",
          " with WUTF clear, ", high_while_set ? "high" : "low", " with it set", crlf);
    bench.verdict("the alarm output follows the flag it was pointed at",
                  low_while_clear && high_while_set);
    Rtc::alarm_output(RtcOutput::off);
    Rtc::clear_wakeup();
    bench.verdict("and it goes back off", Rtc::alarm_output() == RtcOutput::off);

    // The crystal again, after all that toggling.
    uint32_t noisy_cycles = 0;
    const bool noisy = measure_seconds(2, noisy_cycles);
    const int32_t noisy_ppm = noisy ? ppm_of(noisy_cycles, 2ULL * SysClock::hz) : 0;
    print(serial, "  the crystal weighed ", quiet_ppm, " ppm before the pad moved and ", noisy_ppm,
          " ppm after (ES0287 2.2.10)", crlf);
    bench.verdict("the crystal still runs after RTC_AF1 has been driven",
                  quiet && noisy && noisy_ppm > -200 && noisy_ppm < 200);

    Led::output(true);   // the LED off on the black pill, where this pad is it
}

// =============================================================================
// n - the timestamp on RTC_AF1
// =============================================================================
/// Make a rising edge on RTC_AF1 with nothing attached to it. The pad is
/// driven low while the timestamp is OFF - the one state in which the
/// core certainly owns it - and then released into the RTC, so the edge
/// comes either from the core's own store or from the board's pull-up,
/// whichever owns the pad by then.
void make_pad_edge() {
    Rtc::timestamp_enable(false);
    RtcPad::output(false);
    wait_ms(5);
    Rtc::timestamp_enable(true, false);   // rising edge
    RtcPad::set();
}

void tn_timestamp() {
    Rtc::clear_flags(RtcFlag::timestamp | RtcFlag::timestamp_overflow);
    Rtc::timestamp_interrupt(false);
    Rtc::timestamp_enable(false);
    bench.verdict("the timestamp is off to start with", !Rtc::timestamp_enabled());

    // Who owns the pad, with the timestamp off and with it on: RM0383's
    // table 25 gives the RTC "TIMESTAMP input floating", and this is what
    // that costs a program that wanted to drive the pin.
    RtcPad::output(false);
    wait_ms(2);
    const bool core_owns_it_off = !RtcPad::read();
    RtcPad::set();
    wait_ms(2);
    const bool core_drives_high = RtcPad::read();
    Rtc::timestamp_enable(true, false);
    RtcPad::clear();
    wait_ms(20);
    const bool core_owns_it_on = !RtcPad::read();
    print(serial, "  with the timestamp off the core drives RTC_AF1 ",
          core_owns_it_off && core_drives_high ? "both ways" : "not at all",
          "; with it on the pad reads ", core_owns_it_on ? "what the core writes" : "HIGH ANYWAY",
          crlf);
    bench.verdict("with no RTC input enabled, RTC_AF1 is an ordinary GPIO",
                  core_owns_it_off && core_drives_high);
    bench.verdict("and with the timestamp enabled the RTC takes the pad (table 25)",
                  !core_owns_it_on);

    // The polled path: with no interrupt, TSF stands and the timestamp
    // registers stay frozen for the reader.
    Rtc::clear_flags(RtcFlag::timestamp | RtcFlag::timestamp_overflow);
    uint64_t made = 0;
    // THE STIMULUS IS THE BOARD'S: with the timestamp on the RTC holds the
    // pad and the GPIO's driver AND pulls no longer reach it (measured: a
    // pull-up set in PUPDR leaves the input reading low), so the only
    // thing that can lift a pad driven low before the enable is what the
    // board hangs on it - a real pull-up on the Nucleo's button pad, a
    // diode's forward drop from the rail through the black pill's LED,
    // which crossed the threshold in 18..29 ms once and never on other
    // runs. So the edge is REPORTED, and the data path judged only when
    // the board made one.
    made = cycles_now();
    make_pad_edge();
    const bool took = wait_flag(RtcFlag::timestamp, 500);
    print(serial, "  the board's pull on RTC_AF1 ", took ? "made the edge" :
          "did NOT lift the pad within 500 ms - this board hangs only its LED on it, and the "
          "data path below is not judged", crlf);
    if (took) {
        bench.verdict("an edge on RTC_AF1 raises TSF with no wire on the board", took);
        const uint32_t latency = static_cast<uint32_t>(cycles_now() - made);
        const RtcReading ts = Rtc::timestamp();
        RtcReading now{};
        (void)Rtc::read(now);
        print(serial, "  the timestamp reads ", ts.time.hour, ":", ts.time.minute, ":",
              ts.time.second, " ss ", ts.subsecond, ", the calendar ", now.time.hour, ":",
              now.time.minute, ":", now.time.second, "; the flag came ",
              latency / (SysClock::hz / 1000u), " ms after the pad was released", crlf);
        bench.verdict("the frozen registers carry the calendar the event happened at",
                      ts.time.second == now.time.second ||
                          ts.time.second == static_cast<uint8_t>((now.time.second + 59u) % 60u));
        bench.verdict("and its sub-second is inside PREDIV_S",
                      ts.subsecond <= Rtc::prescalers().sync);
    }

