uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
    // A second event while TSF stands is an overflow.
    if (took) {
        make_pad_edge();
        const bool overflowed = wait_flag(RtcFlag::timestamp_overflow, 500);
        bench.verdict("a second event while TSF stands raises TSOVF", overflowed);
    }

    // And the interrupt path, where the flag is cleared for you: the
    // handler has to take the reading BEFORE the ISR body runs.
    Rtc::clear_flags(RtcFlag::timestamp | RtcFlag::timestamp_overflow);
    stamp_count = 0;
    Rtc::timestamp_interrupt(true);
    bench.verdict("TSIE is on and the shared EXTI line is open",
                  Rtc::wake_line_is_open(Rtc::tamper_stamp_exti_line));
    make_pad_edge();
    const uint32_t started = Ticker::ticks();
    while (stamp_count == 0u && Ticker::ticks() - started < 500u) {
    }
    const bool served = stamp_count != 0u;
    const RtcReading kept = stamp_reading;
    const RtcReading after = Rtc::timestamp();
    if (took) {
        bench.verdict("the handler serves the timestamp", served &&
                                                              (stamp_served & RtcFlag::timestamp) != 0u);
        print(serial, "  the handler kept ", kept.time.hour, ":", kept.time.minute, ":",
              kept.time.second, "; the registers read ", after.time.hour, ":", after.time.minute,
              ":", after.time.second, " once the flag was cleared", crlf);
        bench.verdict("what it read before clearing the flag is a time", served && kept.time.month >= 1u);
    }
    bench.verdict("and the registers are EMPTY after the clear: TSF is what freezes them",
                  after.time.hour == 0u && after.time.minute == 0u && after.time.second == 0u &&
                      after.subsecond == 0u);

    Rtc::timestamp_interrupt(false);
    Rtc::timestamp_enable(false);
    Rtc::clear_flags(RtcFlag::timestamp | RtcFlag::timestamp_overflow);
    bench.verdict("the timestamp goes off and its flags with it",
                  !Rtc::timestamp_enabled() && !Rtc::flag(RtcFlag::timestamp) &&
                      !Rtc::flag(RtcFlag::timestamp_overflow));
    Led::output(true);
}

// =============================================================================
// v - the backup registers across a reset (outside z)
// =============================================================================
constexpr uint32_t token_magic = 0x5F4B4231u;

void tv_survival() {
    const uint32_t magic = Rtc::backup(0);
    if (magic != token_magic) {
        for (uint8_t i = 0; i < Rtc::backup_count; ++i) {
            (void)Rtc::backup(i, 0x0BADC0DEu + i);
        }
        (void)Rtc::backup(0, token_magic);
        print(serial, "  leg 1: the token is written. Re-flash this same image and run v "
                      "again - the flash ends in a system reset, which the backup domain "
                      "does not see.", crlf);
        bench.verdict("the token went in", Rtc::backup(0) == token_magic);
        return;
    }
    bool intact = true;
    for (uint8_t i = 1; i < Rtc::backup_count; ++i) {
        intact = intact && Rtc::backup(i) == 0x0BADC0DEu + i;
    }
    print(serial, "  leg 2: the token survived, and so did ", Rtc::backup_count - 1u,
          " words behind it", crlf);
    bench.verdict("the backup registers came through a system reset intact", intact);
    bench.verdict("and the calendar with them", Rtc::calendar_set());
    (void)Rtc::backup(0, 0u);
    print(serial, "  the token is cleared: the next v starts leg 1 again", crlf);
}

// =============================================================================
// w - the erase: a real tamper (outside z)
// =============================================================================
void tw_tamper() {
    print(serial, "  this letter SPENDS the twenty backup registers", crlf);
    for (uint8_t i = 0; i < Rtc::backup_count; ++i) {
        (void)Rtc::backup(i, 0xC0FFEE00u + i);
    }
    bench.verdict("the registers carry a token to lose", Rtc::backup(3) == 0xC0FFEE03u);

    RtcPad::input();
    print(serial, "  RTC_AF1 floats ", RtcPad::read() ? "high" : "low", " on this board", crlf);

    Rtc::clear_flags(RtcFlag::tamper);
    (void)Rtc::tamper_disarm(1);
    bench.verdict("the block's mode is writable while nothing is armed",
                  Rtc::tamper_config(TamperConfig{TamperFilter::samples2, TamperSampling::div256,
                                                  TamperPrecharge::cycles8, true}));
    Rtc::timestamp_on_tamper(true);
    Rtc::tamper_interrupt(true);
    stamp_count = 0;

    // The filtered detector precharges the pad through the internal
    // pull-up and samples it at TAMPFREQ, so "staying high" fires after
    // two samples with nothing attached at all.
    const uint64_t armed_at = cycles_now();
    bench.verdict("tamper 1 arms", Rtc::tamper_arm(TamperInput{
                                       1, TamperTrigger::high_level_or_falling_edge}));
    bench.verdict("and the mode is refused while it is armed",
                  !Rtc::tamper_config(TamperConfig{}));
    const bool fired = wait_flag(RtcFlag::tamper1, 2000) || stamp_count != 0u;
    if (fired) {
        const uint32_t latency = static_cast<uint32_t>(stamp_at - armed_at);
        print(serial, "  the tamper fired ", latency / (SysClock::hz / 1000u),
              " ms after arming (two samples at 128 Hz is 16 ms)", crlf);
    }
    bench.verdict("a filtered high level fires the tamper with nothing on the pad", fired);
    bench.verdict("and the twenty backup registers are gone",
                  Rtc::backup(0) == 0u && Rtc::backup(19) == 0u);
    bench.verdict("TAMPTS filled the timestamp registers", Rtc::flag(RtcFlag::timestamp));
    const RtcReading ts = Rtc::timestamp();
    print(serial, "  the tamper's timestamp reads ", ts.time.hour, ":", ts.time.minute, ":",
          ts.time.second, crlf);

    Rtc::tamper_interrupt(false);
    Rtc::timestamp_on_tamper(false);
    bench.verdict("the input disarms", Rtc::tamper_disarm(1));
    Rtc::clear_flags(RtcFlag::all);
    bench.verdict("and every flag is down", (Rtc::status() & RtcFlag::all) == 0u);
    Led::output(true);
}

