uliano/brio/stm32f4/src/apps/test_stm32f4_rtc.cpp
// =============================================================================
// x - the 1 Hz left on the pad, for a human (outside z)
// =============================================================================
void tx_show() {
    RtcPad::input();
    const bool on = Rtc::calibration_output(true, RtcCalibOutput::hz1);
    print(serial, "  RTC_CALIB is on at 1 Hz on RTC_AF1 - the LED on a black pill. "
                  "Any other letter takes the pad back.", crlf);
    bench.verdict("the 1 Hz output is on", on && Rtc::calibration_output());
}

void banner() {
    print(serial, crlf,
          "test_stm32f4_rtc - the RTC and the backup domain, weighed on SysTick", crlf);
    bench.menu();
}

} // namespace

// ---- target glue ------------------------------------------------------------
#if defined(STM32F446xx)
extern "C" void USART2_IRQHandler() { (void)Serial::isr(); }
#else
extern "C" void USART1_IRQHandler() { (void)Serial::isr(); }
#endif
extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

extern "C" void RTC_Alarm_IRQHandler() {
    const uint32_t served = brio::Rtc::alarm_isr();
    if (served != 0u) {
        alarm_at = cycles_now();
        alarm_served = served;
        alarm_count = alarm_count + 1u;
    }
}
extern "C" void RTC_WKUP_IRQHandler() {
    const uint32_t served = brio::Rtc::wakeup_isr();
    if (served != 0u) {
        wakeup_at = cycles_now();
        wakeup_served = served;
        wakeup_count = wakeup_count + 1u;
    }
}
extern "C" void TAMP_STAMP_IRQHandler() {
    // THE TIMESTAMP REGISTERS ARE FROZEN ONLY WHILE TSF STANDS (17.6.13:
    // "it is cleared when TSF bit is reset"), and the ISR body's first
    // act is to clear the flags it serves - so a handler that means to
    // keep the reading takes it FIRST. Measured: read afterwards, it is
    // all zeros.
    const brio::RtcReading ts = brio::Rtc::timestamp();
    const uint32_t served = brio::Rtc::tamper_stamp_isr();
    if (served != 0u) {
        stamp_at = cycles_now();
        stamp_served = served;
        stamp_reading = ts;
        stamp_count = stamp_count + 1u;
    }
}

int main() {
    const bool clock_ok = SysClock::init();
    const bool serial_ok = Serial::init(clock, 115200);
    const bool tick_ok = brio::Ticker::init(clock);
    Led::output(true);
    brio::enable_interrupts();

    const bool domain_ok = bring_up(brio::RtcClockSource::lse);
    arm_vectors();

    bench.letter('a', "the domain and its two locks", ta_domain);
    bench.letter('b', "the LSE crystal: the start-up and the frequency", tb_lse);
    bench.letter('c', "the LSI weighed (and two domain resets)", tc_lsi);
    bench.letter('d', "the calendar, BCD both ways and four boundaries", td_calendar);
    bench.letter('e', "the shadow registers against BYPSHAD", te_shadow);
    bench.letter('f', "both alarms, the latency and the sub-second match", tf_alarms);
    bench.letter('g', "the wake-up timer on three clocks", tg_wakeup);
    bench.letter('h', "ES0287 2.8.4 staged: consecutive initializations", th_init_erratum);
    bench.letter('i', "smooth calibration, measured", ti_calibration);
    bench.letter('j', "coarse calibration and the interlock", tj_coarse);
    bench.letter('k', "the sub-second register and a shift", tk_shift);
    bench.letter('l', "the twenty backup registers", tl_backup);
    bench.letter('m', "the RTC_OUT pad: the outputs counted", tm_output);
    bench.letter('n', "the timestamp on RTC_AF1", tn_timestamp);
    bench.letter('v', "the backup registers across a reset", tv_survival, false);
    bench.letter('w', "THE ERASE: a real tamper", tw_tamper, false);
    bench.letter('x', "the 1 Hz left on the pad", tx_show, false);

    if (serial_ok) {
        brio::print(serial, brio::crlf, "boot: clk=", clock_ok ? "PLL" : "FAILED",
                    " tick=", tick_ok ? "SysTick" : "FAILED",
                    " rtc=", domain_ok ? "LSE" : "FAILED", brio::crlf);
        banner();
        bench.prompt();
    }

    for (;;) {
        uint8_t c = 0;
        if (!Serial::read_byte(c)) {
            continue;
        }
        if (c == '\r' || c == '\n') {
            continue;
        }
        brio::print(serial, static_cast<char>(c), brio::crlf);
        if (c == '?') {
            banner();
        } else if (!bench.handle(static_cast<char>(c))) {
            brio::print(serial, "unknown letter (? for the menu)", brio::crlf);
        }
        bench.prompt();
    }
}
